ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/failover/bpels/CorrelationSubBP/CorrSubBPBpel/src/SubBPWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="SubBPWSDLRIT39663" targetNamespace="http://j2ee.netbeans.org/wsdl/SubBPWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SubBPWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:vprop="http://docs.oasis-open.org/wsbpel/2.0/varprop">
    <types/>
    <message name="SubBPWSDLOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="SubBPWSDLOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="SubBPWSDLPortType">
        <wsdl:operation name="SubBPWSDLOperation">
            <wsdl:input name="input1" message="tns:SubBPWSDLOperationRequest"/>
            <wsdl:output name="output1" message="tns:SubBPWSDLOperationReply"/>
        </wsdl:operation>
    </portType>
    <portType name="SubBPWSDLPortType1">
        <wsdl:operation name="SubBPWSDLOperation">
            <wsdl:input name="input1" message="tns:SubBPWSDLOperationRequest"/>
            <wsdl:output name="output1" message="tns:SubBPWSDLOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="SubBPWSDLBinding" type="tns:SubBPWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="SubBPWSDLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SubBPWSDL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SubBPWSDL"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <binding name="SubBPWSDLBinding1" type="tns:SubBPWSDLPortType1">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
        <wsdl:operation name="SubBPWSDLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SubBPWSDL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SubBPWSDL"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="SubBPWSDLService">
        <wsdl:port name="SubBPWSDLPort" binding="tns:SubBPWSDLBinding">
            <soap:address location="http://localhost:18181/SubBPWSDLService/SubBPWSDLPort"/>
        </wsdl:port>
        <wsdl:port name="SubBPWSDLPort1" binding="tns:SubBPWSDLBinding1">
            <soap:address location="http://localhost:18181/SubBPWSDLService/SubBPWSDLPort1"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="SubBPWSDLRIT396631">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SubBPWSDLPortTypeRole" portType="tns:SubBPWSDLPortType"/>
    </plnk:partnerLinkType>
    <plnk:partnerLinkType name="SubBPWSDLRIT3966312">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SubBPWSDLPortType1Role" portType="tns:SubBPWSDLPortType1"/>
    </plnk:partnerLinkType>
    <vprop:property name="property1" type="xsd:string"/>
    <vprop:propertyAlias propertyName="tns:property1" messageType="tns:SubBPWSDLOperationRequest" part="part1"/>
</definitions>
