driver-tests/bpelse/scalability/ScalabilityJbi/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sub="http://j2ee.netbeans.org/wsdl/SubBPWSDL">
  <soapenv:Body>
    <sub:SubBPWSDLOperation>
      <part1>P0Y0M0DT0H0M30S</part1>
    </sub:SubBPWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>